Revit 2027 API
BuiltInFailures.AutoJoinFailures.UnexpectedJoinFailure Property
 Join failure caused by editability or design option related problem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnexpectedJoinFailure { get; }
Public Shared ReadOnly Property UnexpectedJoinFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnexpectedJoinFailure {
	FailureDefinitionId^ get ();
}
static member UnexpectedJoinFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoJoinFailures Class
Autodesk.Revit.DB Namespace